/*Среднее арифметическое массива
Считать массив из 12 элементов и посчитать среднее арифметическое элементов массива.
Формат входных данных
12 целых чисел через пробел
Формат результата
Среднее арифметическое в формате "%.2f"
Примеры
Входные данные
4 -5 3 10 -4 -6 8 -10 1 0 5 7
Результат работы
1.08
Входные данные
1 2 3 4 5 6 7 8 9 10 11 12
Результат работы
6.50*/

#include <stdio.h>

#define SIZE 12

void array(int arr[], int n)
{
	float sum;
	for(int i = 0; i < n; i++)
	{
		sum += arr[i];
	}
	printf("%.2f", sum/SIZE);
}

int main(void)
{
	int arr[SIZE];
	for(int i = 0; i < SIZE; i++)
	{
		scanf("%d", &arr[i]);
	}
	array(arr, SIZE);
	return 0;
}