/*B3 Урок 5 ДЗ 1
Сумма квадратов маленьких чисел
Ввести два целых числа a и b (a ≤ b) и вывести сумму квадратов всех чисел от a до b. 

Данные на входе:	Два целых числа по модулю не больше 100 
Данные на выходе:	Сумма квадратов от первого введенного числа до второго 

Пример №1
Данные на входе:	4 10 
Данные на выходе:	371 

Пример №2
Данные на входе:	1 5 
Данные на выходе:	55 */

#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "ru_RU.UTF-8");
	int a, b, c, d;
	printf("Введите два целых числа по модулю не больше 100 через пробел : ");
	scanf("%d%d", &a, &b);
	if (a <= b)
	{
		for(a = a; a <= b; a++)
		{
			c = a * a;
			d += c;
		}
	}
	else 
	{
		printf("Ошибка");
		return 1;
	}
	printf("%d\n", d);
	return 0;
}