/*B6 Урок 5 Практика №2
Две одинаковые цифры рядом
Ввести целое число и определить, верно ли, что в его записи есть две одинаковые цифры, стоящие рядом. 

Данные на входе:	Одно целое число 
Данные на выходе:	Единственное слов: YES или NO 

Пример №1
Данные на входе:	1232 
Данные на выходе:	NO 

Пример №2
Данные на входе:	1224 
Данные на выходе:	YES */

#include <stdio.h>
#include <locale.h>

int main()
{
	int x, number, z = 0;
	setlocale(LC_ALL, "ru_RU.UTF-8");
	printf("Введите одно целое число: ");
	scanf(" %d", &x);
	while (x > 0)
	{
		number = x % 10;
		if ( number == z)
		{
			printf ("YES");
			break;
		}
			z = number;
			x/=10;
		if (x <= 0)
			printf("NO");
	}
	return 0;
}